In [1]:
import pandas as pd

In [2]:
data = {'Name': ["Ahmad" , "Ali" , "Hajra", "Usama" , "Ayesha"  ,"Saqib"] , 
        'Gender' : ['male','male','female','male','female','male'] , 
        'Marks': [43,56,89,65,90,68]}

In [3]:
dataframe = pd.DataFrame(data)
dataframe

     Name  Gender  Marks
0   Ahmad    male     43
1     Ali    male     56
2   Hajra  female     89
3   Usama    male     65
4  Ayesha  female     90
5   Saqib    male     68

If we want to make predictions and we also have to include gender column then we have to use One Hot Encoding because it is a string column and our model will not be able to use it.

In [4]:
#Here we will use pandas getdummies() function to do One Hot Encoding
ohe_dataframe = pd.get_dummies(dataframe.Gender)
ohe_dataframe

   female  male
0       0     1
1       0     1
2       1     0
3       0     1
4       1     0
5       0     1

Now we have our data in the form of integers
But instead of using both columns we can use only one column
Because we can see if the value of one column is 1 then correspoding value in the other column is 0 and vice versa.

In [5]:
ohe_dataframe = ohe_dataframe.drop('female',axis = 1)

In [6]:
ohe_dataframe

   male
0     1
1     1
2     0
3     1
4     0
5     1

In [7]:
final_dataframe = pd.concat([dataframe , ohe_dataframe] , axis = 1)

In [8]:
final_dataframe

     Name  Gender  Marks  male
0   Ahmad    male     43     1
1     Ali    male     56     1
2   Hajra  female     89     0
3   Usama    male     65     1
4  Ayesha  female     90     0
5   Saqib    male     68     1

Here if we see ,Now there is no use of column named Gender 
Because column named as male is giving us the information
So we will drop that column

In [9]:
final_dataframe = final_dataframe.drop('Gender',axis = 1)

In [10]:
final_dataframe

     Name  Marks  male
0   Ahmad     43     1
1     Ali     56     1
2   Hajra     89     0
3   Usama     65     1
4  Ayesha     90     0
5   Saqib     68     1

Now we can use male column which is giving us the information about the Gender of a student